DaveRichmond/contiki/cpu/dspic/stdio.c
/*
 * Copyright (c) 2013
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the Institute nor the names of its contributors
 * may be used to endorse or promote products derived from this software
 * without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE INSTITUTE AND CONTRIBUTORS ``AS IS'' AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE INSTITUTE OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * This file is part of the Contiki operating system.
 *
 *  Created on: Jun 18, 2013
 *      Author: David Richmond <dave@prstat.org>
 */


/**
 * Target libpic30's input/output
 * loosely based on example code in "16-Bit Language Tools" manual
 **/

#include "dev/dspic_uart.h"

enum handles {
  handle_stdin,
  handle_stdout,
  handle_stderr,
};

int __attribute__((__weak__, __section__(".libc")))
open(const char *name, int access, int mode){
  switch(name[0]){
    case 'i': return handle_stdin;
    case 'o': return handle_stdout;
    case 'e': return handle_stderr;
    default: return handle_stderr;
  }
}

#define STDIO_UART(XX,YY,BAUD)                                                \
    int __attribute__((__weak__, __section__(".libc.write")))                       \
    write(int handle, void *buffer, unsigned int len){                        \
      dspic_uart##XX##_init(BAUD);                                            \
      switch(handle){                                                         \
        case handle_stdin:                                                    \
        case handle_stderr:                                                   \
          while(len--) dspic_uart##XX##_write(*(char *)buffer++);                     \
      }                                                                       \
      return len;                                                             \
    }

int __attribute__((__weak__, __section(".libc.read")))
read(int handle, char *buffer, unsigned int len){
  return 0;
}

#if defined(__USE_UART1_FOR_STDIO)
#elif defined(__USE_UART2_FOR_STDIO)
#elif defined(__USE_UART3_FOR_STDIO)
#else
  STDIO_UART(1, 1, 115200)
#endif
